{
  "cv": {
    "main":"Actuellement à la recherche d'un stage"
  },
  "realisations": {
    "rea1": [{
        "title": "freelance application et site web en PHP / Mysql / AJAX",
        "subtitle": "Arinella",
        "date": "Juillet 2018 - Aujourd'hui",
        "intro": "Site web pour un proche, présentant une villa en Corse. Les options :",
        "list": {
          "1": "Un diaporama de la villa en accueil",
          "2": "Un descriptif des équipements de la villa propulsé par le plugin Jquery UI",
          "3": "Une galerie d'images dynamique pouvant être gérée dans la page d'administration",
          "4": "Une page d'administration protégée par un système de connexion. Elle permet de gérer des administrateurs(ajouter et supprimer) et la galerie grâce à MySQL et PHP (ajouter, modifier, réorganiser...).",
          "5": "Un système d'emailing (rubrique contact) basé sur PHPMailer et le SMTP de google."

        },
        "link": "http://www.arinella.loicroux.fr"
      },
      {
        "title": "projet site bd MySQL et PHP",
        "subtitle": "Alt2crous",
        "date": "Mars 2018 - Avril 2018",
        "intro": "Projet de site dynamique visant à trouver des restaurants autour des lieux d'études de Grenoble.",
        "content": "Site web avec interface d'administration permettant de supprimer, ajouter et modifier des restaurants. br Ensuite les restaurants sont affichés en photo avec une description. En sélectionnant le lieu d'étude proche on trouve grâce à un algorithme les restaurants proches avec également un critère de prix.",
        "link": "http://alt2crous.loicroux.fr"
      },
      {
        "title": "projet développement sur le CMS wordpress (php)",
        "subtitle": "Les plantes urbaines",
        "date": "Novembre 2018 - Janvier 2019",
        "intro": "Selon le cahier des charges d'une autre équipe nous avons dû créer un thème Wordpress adapté à leurs demandes. br Les options que nous avons pu ajouter sont :",
        "list": {
          "1": "Custom type, taxonomies et metaboxes",
          "2": "Pages d'archives selon les taxonomies",
          "3": "Personnalisation avec Redux framework : changement des polices sur les titres, choix des couleurs de fonds, choix du du diaporama et ses options sur la page d'accueil",
          "4": "Slider 3D turtable js paramétrable depuis CMB2",
          "5": "Création de modules pour afficher des éléments spécifiques"
        },
        "link": "http://www.plantes-urbaines.loicroux.fr"
      },
      {
        "title": "javascript projet inaprod",
        "subtitle": "Inaprod",
        "date": "Mai 2018 - Juin 2018",
        "intro": "Projet universitaire en groupe consistant à la création d'une agence de communication fictive. Le site vitrine s'inspire du design flat, il est basé sur des contenus fait pendant le dossier du projet.",
        "content": "De nombreux plugin JS et jQuery sont utilisés afin de donner un aspect plus dynamique au site et de vérifier les formulaires de contact. On peut également noter l'utilisation de SVG et de création de pack d'icon pour apporter des éléments de design supplémentaires au site.",
        "link": "http://inaprod.loicroux.fr"
      },
      {
        "title": "projet tutoré sur le CMS wordpress (php)",
        "subtitle": "Projet tutoré",
        "intro": "Création de la communication à 360° du challenge GCCD au cours d'une semaine de projet intensive. Le projet comporte : définition d'une charte graphique, création du logo et son animation, site web événementiel intégral (Wordpress), contenus écrits et un kakémono. br",
        "content": "Le cachier des charges concernait le challenge construction durable organisé par le DUT génie civil de Grenoble en 2019. br Le site comporte un back office avec des page-template personnalisés et des contenus dynamiques (actualité et vidéos).",
        "link": "http://www.projet-tut.loicroux.fr"
      }
    ],
    "rea2": [
      1, 2, 3, 4, 5,
      {
        "title": "jeu codé en typescript (classes et objets)",
        "subtitle": "Jeu Typescript",
        "date": "Janvier 2019",
        "intro": "Création d'un jeu simple basé sur un template typescript et Canvas.",
        "content": "Le jeu est fait en orienté objet avec l'utilisation des évênements du clavier. On a également des boucles conditionelles pour empécher la sortie du canvas, vérifier des collisions et des méthodes pour dessiner et détruire les éléments sur le canvas.",
        "link": "./jeu/index.html"
      },
      {
        "title": "Livret d‘illustration photoshop indesign et illustrator",
        "subtitle": "Livret d‘illustration",
        "date": "Novembre 2019 - Décembre",
        "content": "Fait à partir de mots ces dessins ont étés retravailler avec Photoshop et Camera raw. Les typographies sont personnalisées avec illustrator et le tout est mis en page sur Indesign.",
        "link": "https://www.behance.net/gallery/75580385/Livret-dillustration?"
      }
    ]
  }
}
